 [{"name": "iPad mini", "category": "tablet", "items_remaining": 5, "image_url": "http://www.newlaunches.com/wp-content/uploads/2013/04/pad-mini.jpg", "description": "<b>Pros</b><br><ul><li>Stunning brushed metal design</li><li>Strong battery life</li><li>Simply, intuitive UI</li></ul><br><b>Cons</b><br><ul><li>Low-res screen</li><li>More expensive than competition<li>No boxed headphones or dock adaptor</ul><br><b>Key Features:</b> 7.9-inch, 1024 x 768p IPS display; Lightning port connector; iOS 6<br>Manufacturer: Apple<br><br>The iPad mini is still available to buy but you shouldn't confuse it with the new iPad mini 2 Retina which looks exactly the same but is more expensive and has some significant improvements over its predecessor.<br><br><b>Key differences between the iPad mini and iPad mini 2:</b><br><br><b>Screen:</b><br><br>The newer iPad mini comes with a Retina display. This offers a much higher resolution than the original iPad mini and it really tells. The screen is much sharper and brighter - it's one of the best tablet screens around. That's not to say that the original iPad mini's screen is rubbish. In fact it's decent. Video and pictures look good, it's when reading text that you'll wish for a higher resolution.<br><br><b>Processor:</b><br><br>The iPad mini comes with the iPad 2's A5 processor in tow. It's a little long in the tooth now but has no problem running apps. The newer iPad mini comes with the same processor as the iPhone 5S, the 64-bit A7. You'll find that 3D games, like Infinity Blade 3, offer more detail and 3D effects on the Retina screen of the new iPad mini. If you want to use heavy duty apps like 3D rendering and video/photo editing you may want to pick up the more expensive iPad mini, but if not the processor jump is less of an issue than the screen.<br><br><b>Camera:</b><br><br>The new iPad mini has a slightly better front and rear camera. You'll get better shots in lower light conditions with it.<br><br><b>Battery life:</b><br><br>Both iPad minis last about the same amount of time - 10 hours of constant use.<br><br><b>Cost:</b><br><br>This is the other big difference between the original iPad mini and the new one. The original has dropped in price and costs £249 for the entry level 16GB Wi-Fi only model. The iPad mini Retina costs £70 at £319. If you only intend to use your iPad for light apps and browsing then the original iPad mini should suffice, but if you can afford the extra £70 you won't be disappointed by the stunning screen on the newer model."},
  {"name": "original iPad", "category": "Tablet", "items_remaining": 213, "image_url": "http://i-repairservice.com/i-repairservice.com/wp-content/uploads/2013/12/ipad1_2.jpga50d29f8-c0fc-461d-b3ad-97261c0d5e38Large.jpg", "description": "The first-generation iPad is a tablet computer designed and marketed by Apple Inc. as the first in the iPad line. The device features an Apple A4 processor, a 9.7\" touchscreen display, and on certain variants the capability of accessing cellular networks. Using the iOS operating system, the iPad can play music, send and receive email and browse the web. Other functions, which include the ability to play games and access references, GPS navigation software and social network services can be enabled by downloading apps.\n\nThe device was announced and unveiled on January 27, 2010 at a media conference. On April 4, 2010, the Wi-Fi variant of the device was released in the United States, followed by the release of the Wi-Fi + Cellular variant on April 30. On May 28, it was released in Australia, Canada, France, Japan, Italy, Germany, Spain, Switzerland and the United Kingdom.\n\nThe device received primarily positive reviews from various technology blogs and publications. Reviewers praised the device for its wide range of capabilities and labelled it as a competitor to laptops and netbooks. Some aspects were criticized, including the closed nature of the operating system and the lack of support for the Adobe Flash multimedia format. During the first 80 days, three million iPads were sold. By the launch of the iPad 2, Apple sold more than 15 million iPads.\n\nOn March 2, 2011, Apple announced the new iPad 2 and the discontinuation of production of the original iPad.[6]"},
  {"name": "Motorola Xoom", "category": "Tablet", "items_remaining": 1, "image_url": "http://www.lazytechguys.com/wp-content/uploads/2011/01/CES-2011-MOTOROLA-XOOM-620x348.jpg", "description": "The Motorola Xoom is an Android-based tablet computer by Motorola, introduced at CES 2011 on January 5, 2011. It was the first tablet to be sold with Android 3.0 Honeycomb. The Verizon branded Xoom was the first tablet to run Android 3.1. The Motorola Xoom went through the FCC on February 10, 2011 only 14 days before release. The 3G version was released on February 24, 2011, and the Wi-Fi version was released March 27, 2011. It was announced concurrently with three other products: the Motorola Atrix, the Motorola Droid Bionic, and the Motorola Cliq 2. CNET named it the \"Best of the CES\" 2011."},
  {"name": "iPhone", "category": "Phone", "items_remaining": 1, "image_url": "http://www.tapscape.com/wp-content/uploads/2014/03/original-iphone-greg-christie.jpeg", "description": "<p>iPhone is a line of smartphones designed and marketed by Apple Inc. They run Apple's iOS mobile operating system. The first generation iPhone was released on June 29, 2007; the most recent iPhone models are the iPhone 6s and iPhone 6s Plus, which were unveiled at a special event on September 9, 2015.</p><p>The user interface is built around the device's multi-touch screen, including a virtual keyboard. The iPhone has Wi-Fi and can connect to cellular networks. An iPhone can shoot video (though this was not a standard feature until the iPhone 3GS), take photos, play music, send and receive email, browse the web, send texts, GPS navigation, record notes, do mathematical calculations, and receive visual voicemail. Other functions—video games, reference works, social networking, etc.—can be enabled by downloading application programs (‘apps’); as of October 2013, the App Store offered more than one million apps by Apple and third parties and is ranked as the world's largest mobile software distribution network of its kind (by number of currently available applications)</p>"},
  {"name": "iPhone 3Gs", "category": "Phone", "items_remaining": null, "image_url": "http://www.iphoned.nl/wp-content/uploads/2013/10/iPhone-3GS.jpg", "description": ""},
  {"name": "iPhone 4", "category": "Phone", "image_url": "http://i.ebayimg.com/images/i/371222340321-0-1/s-l1000.jpg", "description": ""},
  {"name": "iPhone 4s", "category": "Phone", "items_remaining": "5", "image_url": "http://cnet1.cbsistatic.com/hub/i/r/2011/10/27/25925eca-cbf2-11e2-9a4a-0291187b029a/thumbnail/770x433/1b141820b7b60b4e0fbb12d5f42fc732/orig-iphone-4s-white-size.jpg", "description": ""},
  {"name": "Nexus 5", "category": "Phone", "items_remaining": 1, "image_url": "http://www.techtastic.nl/wp-content/uploads/2013/11/xl_LG-Google-Nexus-5-1-624.jpg", "description": ""},
  {"name": "Nexus 5X", "category": "Phone", "items_remaining": 8, "image_url": "", "description": ""},
  {"name": "Nexus 6P", "category": "Phone", "items_remaining": 1, "image_url": "http://blogs-images.forbes.com/gordonkelly/files/2015/09/1338.jpg", "description": ""},
  {"name": "Asus Chromebook", "category": "Computer", "items_remaining": 0, "image_url": "http://www.ultrabookreview.com/wp-content/uploads/2014/06/asus-chrumebook-c300.jpg", "description": ""},
  {"name": "MacBook Air", "category": "Computer", "items_remaining": "7", "image_url": "http://images.apple.com/euro/macbook-air/f/generic/images/overview_hero_hero.jpg", "description": ""},
  {"name": "MacBook Pro", "category": "Computer", "items_remaining": 1, "image_url": "http://cnet2.cbsistatic.com/hub/i/r/2013/10/22/55d5c133-67c2-11e3-a665-14feb5ca9861/thumbnail/770x433/a213d9fd0156b9e63c7a14dfc75f033e/Apple_Macbook_Pro_15_35781448-4070.jpg", "description": ""},
  {"name": "MacBook", "category": "Computer", "items_remaining": 10, "image_url": "https://i.ytimg.com/vi/xRGxC9_I1K4/maxresdefault.jpg", "description": ""}]
